# Mod14 Handling Duplicated Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.__version__

'1.20.1'

In [3]:
pd.__version__

'1.2.4'

### Operating on Duplicated data

In [4]:
students = [('Jack', 34, 'Sydeny'),('Riti', 30, 'Delhi'),('Aadi', 16, 'New York'),('Riti', 30, 'Delhi'),
            ('Riti', 30, 'Delhi'),('Riti', 30, 'Mumbai'),('Aadi', 40, 'London'),('Sachin', 30, 'Delhi')]

df = pd.DataFrame(students, columns=['Name', 'Age', 'City']); df

     Name  Age      City
0    Jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
3    Riti   30     Delhi
4    Riti   30     Delhi
5    Riti   30    Mumbai
6    Aadi   40    London
7  Sachin   30     Delhi

In [18]:
print(df.duplicated(), end="\n-------------------\n")                   # 預設檢查是否有整列重複的資料
print(df.duplicated().any(), end="\n-------------------\n")             # 當資料量很大的時候用any來檢查比較適合
print(df.duplicated().values.any(), end="\n-------------------\n")

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7    False
dtype: bool
-------------------
True
-------------------
True
-------------------

In [6]:
print(np.sum(df.duplicated()))
print(df.duplicated().sum())

2
2

In [25]:
df[df.duplicated()]

   Name  Age   City
3  Riti   30  Delhi
4  Riti   30  Delhi

In [47]:
print(df['City'].duplicated(), end="\n-------------------\n")     # 只看city這欄是否有重複的值
print(df.duplicated('City'), end="\n-------------------\n")                   
print(df.duplicated(subset='City'))

0    False
1    False
2    False
3     True
4     True
5    False
6    False
7     True
Name: City, dtype: bool
-------------------
0    False
1    False
2    False
3     True
4     True
5    False
6    False
7     True
dtype: bool
-------------------
0    False
1    False
2    False
3     True
4     True
5    False
6    False
7     True
dtype: bool

Alternatively, you can add ‘keep’ and indicate
whether you’d like to keep:
* keep='first', keep the first argumen(default)
* keep='last', keep the last argument
* keep=False, drop all the duplicates

In [33]:
display(df[df.duplicated(subset=('Name','Age'),keep='first')])      # 預設，保留第一筆重複的資料
display(df[df.duplicated(subset=('Name','Age'),keep='last')])       # 保留最後一筆重複的資料
display(df[df.duplicated(subset=('Name','Age'),keep=False)])        # 全部重複的資料都刪除

   Name  Age    City
3  Riti   30   Delhi
4  Riti   30   Delhi
5  Riti   30  Mumbai

   Name  Age   City
1  Riti   30  Delhi
3  Riti   30  Delhi
4  Riti   30  Delhi

   Name  Age    City
1  Riti   30   Delhi
3  Riti   30   Delhi
4  Riti   30   Delhi
5  Riti   30  Mumbai

In [34]:
display(df[~df.duplicated(subset=('Name','Age'),keep='first')])      # 顯示沒有重複的資料

     Name  Age      City
0    Jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
6    Aadi   40    London
7  Sachin   30     Delhi

### Dropping duplicates

In [42]:
display(df.drop_duplicates().reset_index())                   # reset_index()會保留舊的index並給新的index
display(df.drop_duplicates().reset_index(drop=True))          # reset_index()會刪除舊的index並給新的index

   index    Name  Age      City
0      0    Jack   34    Sydeny
1      1    Riti   30     Delhi
2      2    Aadi   16  New York
3      5    Riti   30    Mumbai
4      6    Aadi   40    London
5      7  Sachin   30     Delhi

     Name  Age      City
0    Jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
3    Riti   30    Mumbai
4    Aadi   40    London
5  Sachin   30     Delhi

In [69]:
# drop duplicates from column
df.drop_duplicates(subset=['Age','City'])

   Name  Age      City
0  Jack   34    Sydeny
1  Riti   30     Delhi
2  Aadi   16  New York
5  Riti   30    Mumbai
6  Aadi   40    London

In [37]:
df.drop_duplicates(subset=('Name','Age'), keep="first")

     Name  Age      City
0    Jack   34    Sydeny
1    Riti   30     Delhi
2    Aadi   16  New York
6    Aadi   40    London
7  Sachin   30     Delhi

## Lab

<b>有一個 DataFrame df，試著計算整列重複的資料有幾個?</b>

In [49]:
df = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [50]:
df.duplicated().sum()

1

<b>計算 'k1' 欄有幾個重複的資料</b>

In [52]:
df.duplicated("k1").sum()

5

<b>試著將整列重複的拋棄，只留第一筆重複值</b>

In [53]:
df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4